# Proyecto: Análisis de delitos en la Ciudad Autónoma de Buenos Aires en el año 2024 | Consultas SQL avanzadas

## Librerías y configuración inicial

In [19]:
import pandas as pd
from sqlalchemy import create_engine
import os
from dotenv import load_dotenv

!pip install prettytable==3.9.0 # Asegurarse de que prettytable está instalado

# Cargar las variables de entorno desde el archivo .env
load_dotenv()

# --- Configuración de la conexión segura ---
db_user = os.getenv("DB_USER")
db_password = os.getenv("DB_PASSWORD")
db_host = 'localhost'
db_port = '5432'
db_name = 'delitos_db'

# Validar que las variables se cargaron
if not db_user or not db_password:
    raise ValueError("No se encontraron las credenciales de la base de datos en las variables de entorno.")

# Crear la cadena de conexión
connection_str = f'postgresql://{db_user}:{db_password}@{db_host}:{db_port}/{db_name}'
engine = create_engine(connection_str)

print("Conexión establecida de forma segura.")
# --- Fin de la configuración de la conexión segura ---

Requirement already satisfied: prettytable==3.9.0 in /usr/local/python/3.12.1/lib/python3.12/site-packages (3.9.0)
Requirement already satisfied: wcwidth in /home/codespace/.local/lib/python3.12/site-packages (from prettytable==3.9.0) (0.2.13)

[notice] A new release of pip is available: 25.1.1 -> 25.2
[notice] To update, run: python3 -m pip install --upgrade pip
Conexión establecida de forma segura.

## Carga de datos

In [20]:
# --- Carga de datos ---
# Cargar el archivo CSV en un DataFrame de Pandas
df_delitos = pd.read_csv('delitos_2024.csv')

# Limpiar nombres de columnas (buena práctica)
# Reemplaza espacios y caracteres especiales por guiones bajos
df_delitos.columns = df_delitos.columns.str.replace(' ', '_').str.lower()

# Nombre de la tabla en la base de datos
table_name = 'delitos'

# --- Subir el DataFrame a PostgreSQL ---
try:
    # Usamos el método to_sql de pandas
    # if_exists='replace' borrará la tabla si ya existe y la creará de nuevo.
    # index=False evita que se guarde el índice del DataFrame como una columna en la tabla
    # Esto es útil para evitar duplicados y mantener la tabla limpia.
    df_delitos.to_sql(table_name, engine, if_exists='replace', index=False)
    print(f"¡Éxito! Se cargaron {len(df_delitos)} registros en la tabla '{table_name}'.")

except Exception as e:
    print(f"Ocurrió un error: {e}")

¡Éxito! Se cargaron 158838 registros en la tabla 'delitos'.

In [21]:
print(df_delitos.columns)

Index(['id-mapa', 'anio', 'mes', 'dia', 'fecha', 'franja', 'tipo', 'subtipo',
       'uso_arma', 'uso_moto', 'barrio', 'comuna', 'latitud', 'longitud',
       'cantidad'],
      dtype='object')

## Consultas avanzadas SQL con "Magic Commands"

### Carga de la extensión de SQL para consultas avanzadas

In [22]:
# --- Carga de la extensión de SQL para consultas avanzadas ---
# Esto permite usar comandos SQL directamente en el notebook
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### Conexión para la extensión

In [23]:
%sql postgresql://{db_user}:{db_password}@{db_host}/{db_name}

### 1. Top 10 Barrios con mayor cantidad de delito

In [24]:
%%sql
SELECT barrio, SUM(cantidad) as total_delitos
FROM delitos
GROUP BY barrio
ORDER BY total_delitos DESC
LIMIT 10;

 * postgresql://user_delitos:***@localhost/delitos_db
10 rows affected.

[('PALERMO', Decimal('12794')),
 ('BALVANERA', Decimal('9967')),
 ('FLORES', Decimal('8509')),
 ('CABALLITO', Decimal('6863')),
 ('RECOLETA', Decimal('6690')),
 ('ALMAGRO', Decimal('6026')),
 ('VILLA LUGANO', Decimal('5861')),
 ('SAN NICOLAS', Decimal('5831')),
 ('BARRACAS', Decimal('5389')),
 ('BELGRANO', Decimal('5043'))]

### 2. Distribución de delitos por día de la semana

In [25]:
%%sql
SELECT dia, SUM(cantidad) as total_delitos
FROM delitos
GROUP BY dia
ORDER BY
    CASE
        WHEN dia = 'Lunes' THEN 1
        WHEN dia = 'Martes' THEN 2
        WHEN dia = 'Miércoles' THEN 3
        WHEN dia = 'Jueves' THEN 4
        WHEN dia = 'Viernes' THEN 5
        WHEN dia = 'Sábado' THEN 6
        WHEN dia = 'Domingo' THEN 7
    END;

 * postgresql://user_delitos:***@localhost/delitos_db
7 rows affected.

[('DOMINGO', Decimal('19990')),
 ('MARTES', Decimal('22501')),
 ('VIERNES', Decimal('24216')),
 ('MIERCOLES', Decimal('23038')),
 ('LUNES', Decimal('23229')),
 ('SABADO', Decimal('22943')),
 ('JUEVES', Decimal('22921'))]

### 3. Delitos por franja horaria para entender patrones diarios

**Notas sobre el tratamiento de datos:**
Para este análisis, los registros con valores nulos (`NULL`/`None`) en la columna `franja` han sido asignados al valor `24`. Esta decisión se tomó para mantener la totalidad de los datos en el análisis sin descartar registros y para agrupar los datos faltantes en una categoría separada, facilitando su visualización y comprensión. El valor `24` se eligió arbitrariamente ya que no representa una franja horaria válida dentro del rango 0-23, lo que previene confusiones con los datos existentes.

In [26]:
%%sql
-- NOTA: Se utiliza COALESCE para asignar los valores nulos de la franja horaria a 24.
-- Esto permite mantener los registros incompletos y agruparlos en una categoría separada para el análisis.
SELECT COALESCE(franja, 24) as franja, SUM(cantidad) as total_delitos
FROM delitos
GROUP BY franja
ORDER BY franja ASC;

 * postgresql://user_delitos:***@localhost/delitos_db
25 rows affected.

[(0.0, Decimal('5119')),
 (1.0, Decimal('3604')),
 (2.0, Decimal('3002')),
 (3.0, Decimal('2947')),
 (4.0, Decimal('3014')),
 (5.0, Decimal('3633')),
 (6.0, Decimal('5043')),
 (7.0, Decimal('7785')),
 (8.0, Decimal('8210')),
 (9.0, Decimal('7527')),
 (10.0, Decimal('7574')),
 (11.0, Decimal('6638')),
 (12.0, Decimal('8191')),
 (13.0, Decimal('6812')),
 (14.0, Decimal('7331')),
 (15.0, Decimal('7586')),
 (16.0, Decimal('7987')),
 (17.0, Decimal('8638')),
 (18.0, Decimal('8924')),
 (19.0, Decimal('8345')),
 (20.0, Decimal('8676')),
 (21.0, Decimal('8156')),
 (22.0, Decimal('7402')),
 (23.0, Decimal('6647')),
 (24.0, Decimal('47'))]

### 4. Subtipos de delito más frecuentes

In [27]:
%%sql
SELECT subtipo, SUM(cantidad) as total
FROM delitos
WHERE subtipo IS NOT NULL AND subtipo != ''
GROUP BY subtipo
ORDER BY total DESC
LIMIT 15;

 * postgresql://user_delitos:***@localhost/delitos_db
9 rows affected.

[('Robo total', Decimal('67252')),
 ('Hurto total', Decimal('58119')),
 ('Lesiones por siniestros viales', Decimal('10464')),
 ('Lesiones Dolosas', Decimal('9420')),
 ('Amenazas', Decimal('7603')),
 ('Hurto automotor', Decimal('4652')),
 ('Robo automotor', Decimal('1140')),
 ('Muertes por siniestros viales', Decimal('110')),
 ('Homicidios dolosos', Decimal('78'))]

### 5. Porcentaje de delitos con uso de arma

In [28]:
%%sql
SELECT
    uso_arma,
    SUM(cantidad) as total,
    ROUND((SUM(cantidad) * 100.0 / (SELECT SUM(cantidad) FROM delitos)), 2) as porcentaje
FROM delitos
WHERE uso_arma IN ('SI', 'NO')
GROUP BY uso_arma;

 * postgresql://user_delitos:***@localhost/delitos_db
2 rows affected.

[('NO', Decimal('150393'), Decimal('94.68')),
 ('SI', Decimal('8445'), Decimal('5.32'))]

### 6. Delitos con Uso de Moto por Comuna

In [29]:
%%sql
SELECT comuna, SUM(cantidad) as total_con_moto
FROM delitos
WHERE uso_moto = 'SI'
GROUP BY comuna
ORDER BY total_con_moto DESC;

 * postgresql://user_delitos:***@localhost/delitos_db
16 rows affected.

[(1.0, Decimal('862')),
 (4.0, Decimal('619')),
 (14.0, Decimal('574')),
 (3.0, Decimal('539')),
 (15.0, Decimal('483')),
 (5.0, Decimal('441')),
 (7.0, Decimal('368')),
 (13.0, Decimal('310')),
 (6.0, Decimal('309')),
 (9.0, Decimal('239')),
 (2.0, Decimal('229')),
 (8.0, Decimal('225')),
 (11.0, Decimal('224')),
 (12.0, Decimal('179')),
 (10.0, Decimal('150')),
 (None, Decimal('7'))]

### 7. Evolución mensual de los delitos a lo largo del año

In [30]:
%%sql
SELECT mes, SUM(cantidad) as total_delitos
FROM delitos
GROUP BY mes
ORDER BY mes ASC;

 * postgresql://user_delitos:***@localhost/delitos_db
12 rows affected.

[('ABRIL', Decimal('13518')),
 ('AGOSTO', Decimal('12708')),
 ('DICIEMBRE', Decimal('13361')),
 ('ENERO', Decimal('13626')),
 ('FEBRERO', Decimal('13592')),
 ('JULIO', Decimal('12968')),
 ('JUNIO', Decimal('12874')),
 ('MARZO', Decimal('13915')),
 ('MAYO', Decimal('13383')),
 ('NOVIEMBRE', Decimal('13645')),
 ('OCTUBRE', Decimal('12941')),
 ('SEPTIEMBRE', Decimal('12307'))]

### 8. Top 5 Subtipos de delito en la comuna 1 (la de mayor actividad según el informe 2022)

In [31]:
%%sql
SELECT subtipo, SUM(cantidad) as total
FROM delitos
WHERE comuna = 1 AND subtipo IS NOT NULL
GROUP BY subtipo
ORDER BY total DESC
LIMIT 5;

 * postgresql://user_delitos:***@localhost/delitos_db
5 rows affected.

[('Robo total', Decimal('9684')),
 ('Hurto total', Decimal('7943')),
 ('Lesiones Dolosas', Decimal('1096')),
 ('Lesiones por siniestros viales', Decimal('1002')),
 ('Amenazas', Decimal('810'))]

### 9. Comparativa de Robos vs. Hurtos

In [32]:
%%sql
SELECT tipo, SUM(cantidad) as total
FROM delitos
WHERE tipo IN ('Robo', 'Hurto')
GROUP BY tipo
ORDER BY total DESC;

 * postgresql://user_delitos:***@localhost/delitos_db
2 rows affected.

[('Robo', Decimal('68392')), ('Hurto', Decimal('62771'))]

### 10. Barrios más peligrosos en horario nocturno (20:00 a 06:00)

In [33]:
%%sql
SELECT barrio, SUM(cantidad) as total_delitos_nocturnos
FROM delitos
WHERE franja >= 20 OR franja <= 6
GROUP BY barrio
ORDER BY total_delitos_nocturnos DESC
LIMIT 10;

 * postgresql://user_delitos:***@localhost/delitos_db
10 rows affected.

[('PALERMO', Decimal('5486')),
 ('BALVANERA', Decimal('3221')),
 ('FLORES', Decimal('2832')),
 ('ALMAGRO', Decimal('2446')),
 ('RECOLETA', Decimal('2380')),
 ('CABALLITO', Decimal('2281')),
 ('VILLA LUGANO', Decimal('2224')),
 ('SAN NICOLAS', Decimal('2137')),
 ('BARRACAS', Decimal('2061')),
 ('VILLA CRESPO', Decimal('1953'))]